`terraform apply` for cloudbank:

<details>
<pre>
google_project_iam_custom_role.identify_project_role: Refreshing state... [id=projects/cb-1003-1696/roles/cb_user_sa_role]
google_service_account.cluster_sa: Refreshing state... [id=projects/cb-1003-1696/serviceAccounts/cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com]
google_service_account.cd_sa: Refreshing state... [id=projects/cb-1003-1696/serviceAccounts/cb-cd-sa@cb-1003-1696.iam.gserviceaccount.com]
google_artifact_registry_repository.registry: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1/repositories/cb-registry]
google_project_iam_member.cluster_sa_roles["roles/monitoring.metricWriter"]: Refreshing state... [id=cb-1003-1696/roles/monitoring.metricWriter/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/monitoring.viewer"]: Refreshing state... [id=cb-1003-1696/roles/monitoring.viewer/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/artifactregistry.reader"]: Refreshing state... [id=cb-1003-1696/roles/artifactregistry.reader/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cb-1003-1696/roles/stackdriver.resourceMetadata.writer/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/logging.logWriter"]: Refreshing state... [id=cb-1003-1696/roles/logging.logWriter/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com]
google_project_iam_member.cd_sa_roles["roles/artifactregistry.writer"]: Refreshing state... [id=cb-1003-1696/roles/artifactregistry.writer/serviceaccount:cb-cd-sa@cb-1003-1696.iam.gserviceaccount.com]
google_project_iam_member.cd_sa_roles["roles/container.admin"]: Refreshing state... [id=cb-1003-1696/roles/container.admin/serviceaccount:cb-cd-sa@cb-1003-1696.iam.gserviceaccount.com]
google_service_account_key.cd_sa: Refreshing state... [id=projects/cb-1003-1696/serviceAccounts/cb-cd-sa@cb-1003-1696.iam.gserviceaccount.com/keys/fc50105d4d954fbe97e4453d0988df9dc88a762a]
google_container_cluster.cluster: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster]
google_project_iam_member.identify_project_binding: Refreshing state... [id=cb-1003-1696/projects/cb-1003-1696/roles/cb_user_sa_role/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com]
google_container_node_pool.notebook["user"]: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster/nodePools/nb-user]
google_container_node_pool.dask_worker["worker"]: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster/nodePools/dask-worker]
google_container_node_pool.core: Refreshing state... [id=projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster/nodePools/core-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_container_cluster.cluster has changed
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster"
        name                        = "cb-cluster"
        # (26 unchanged attributes hidden)











      ~ node_pool {
            name                        = "nb-user"
          ~ node_count                  = 2 -> 1
            # (6 unchanged attributes hidden)




            # (4 unchanged blocks hidden)
        }




        # (16 unchanged blocks hidden)
    }

  # google_container_node_pool.notebook["user"] has changed
  ~ resource "google_container_node_pool" "notebook" {
        id                          = "projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster/nodePools/nb-user"
        name                        = "nb-user"
      ~ node_count                  = 2 -> 1
        # (8 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # google_project_iam_member.cd_sa_roles["roles/artifactregistry.writer"] has changed
  ~ resource "google_project_iam_member" "cd_sa_roles" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/roles/artifactregistry.writer/serviceaccount:cb-cd-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.cd_sa_roles["roles/container.admin"] has changed
  ~ resource "google_project_iam_member" "cd_sa_roles" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/roles/container.admin/serviceaccount:cb-cd-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.cluster_sa_roles["roles/artifactregistry.reader"] has changed
  ~ resource "google_project_iam_member" "cluster_sa_roles" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/roles/artifactregistry.reader/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.cluster_sa_roles["roles/logging.logWriter"] has changed
  ~ resource "google_project_iam_member" "cluster_sa_roles" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/roles/logging.logWriter/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.cluster_sa_roles["roles/monitoring.metricWriter"] has changed
  ~ resource "google_project_iam_member" "cluster_sa_roles" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/roles/monitoring.metricWriter/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.cluster_sa_roles["roles/monitoring.viewer"] has changed
  ~ resource "google_project_iam_member" "cluster_sa_roles" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/roles/monitoring.viewer/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.cluster_sa_roles["roles/stackdriver.resourceMetadata.writer"] has changed
  ~ resource "google_project_iam_member" "cluster_sa_roles" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/roles/stackdriver.resourceMetadata.writer/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.identify_project_binding has changed
  ~ resource "google_project_iam_member" "identify_project_binding" {
      ~ etag    = "BwXJT6xb3i4=" -> "BwXZqWSXAKE="
        id      = "cb-1003-1696/projects/cb-1003-1696/roles/cb_user_sa_role/serviceaccount:cb-cluster-sa@cb-1003-1696.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_node_pool.dask_worker["worker"] will be updated in-place
  ~ resource "google_container_node_pool" "dask_worker" {
        id                          = "projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster/nodePools/dask-worker"
        name                        = "dask-worker"
        # (9 unchanged attributes hidden)



      ~ node_config {
            tags              = []
            # (12 unchanged attributes hidden)


          ~ workload_metadata_config {
              + mode = "MODE_UNSPECIFIED"
            }
            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # google_container_node_pool.notebook["user"] must be replaced
-/+ resource "google_container_node_pool" "notebook" {
      ~ id                          = "projects/cb-1003-1696/locations/us-central1-b/clusters/cb-cluster/nodePools/nb-user" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cb-cluster-nb-user-05ebb8d0-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroups/gke-cb-cluster-nb-user-05ebb8d0-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "nb-user"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> (known after apply)
      ~ node_locations              = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.19.12-gke.2100" -> (known after apply)
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> "pd-balanced" # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
            tags              = []
            # (6 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          ~ workload_metadata_config {
              + mode = "MODE_UNSPECIFIED"
            }
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with google_filestore_instance.homedirs,
  on storage.tf line 4, in resource "google_filestore_instance" "homedirs":
   4:   zone = var.zone

Deprecated in favor of location.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

</pre>
</details>